app/controllers/todo_controller.rb

SELECT `users`.* FROM `users`
---
def index

  @todos = User.all.map {|work| work}

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 3
---
  def destroy
    id = params[:id]
    todo = User.find(id)
    todo.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `users`.`completed` = TRUE, `users`.`updated_at` = '2022-06-28 13:15:56.481458' WHERE `users`.`id` = 1
---
  def update
    id= params[:id]
    todo = User.find(id)
    todo[:completed]=true
    if todo.save

INSERT INTO `users` (`task`, `due_date`, `completed`, `created_at`, `updated_at`) VALUES ('Meenu', '2022-06-02', FALSE, '2022-06-28 13:46:44.737316', '2022-06-28 13:46:44.737316')
---
    task = params[:task]
    date = params[:due_date]
    todo = User.create!(
      task: task,
      due_date: date,
      completed: false,
    )