app/views/todo/index.html.erb


<%= render partial: "list" , locals:{ title: "Overdue",todos: User.all}%>
---
SELECT `users`.* FROM `users`